## Eleman İşlemleri

In [6]:
import pandas as pd
import numpy as np

In [7]:
s1 = np.random.randint(10,size = 5)
s2 = np.random.randint(10,size = 5)
s3 = np.random.randint(10,size = 5)

In [10]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}
sozluk

{'var1': array([6, 2, 9, 5, 9]),
 'var2': array([5, 5, 3, 2, 2]),
 'var3': array([8, 5, 7, 6, 1])}

In [12]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     5     8
1     2     5     5
2     9     3     7
3     5     2     6
4     9     2     1

In [13]:
df[0:1]

   var1  var2  var3
0     6     5     8

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     6     5     8
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [18]:
df["c": "e"]

   var1  var2  var3
c     9     3     7
d     5     2     6
e     9     2     1

# silme işlemi

In [19]:
df.drop("a", axis = 0)

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [23]:
df

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [22]:
df.drop("a", axis = 0, inplace = True)

KeyError: "['a'] not found in axis"

# fancy ile birden çok silmesilme

In [24]:
l = ["c", "e"]

In [25]:
df.drop(l)

   var1  var2  var3
b     2     5     5
d     5     2     6

In [27]:
df.drop(l, axis = 0)

   var1  var2  var3
b     2     5     5
d     5     2     6

# değişkenler için

In [29]:
df

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [28]:
"var1" in df

True

In [32]:
l = ["var1", "var4", "var2"]

In [33]:
for i in l:
    print(i in df)

True
False
True

In [34]:
df

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [37]:
df["var1"]

b    2
c    9
d    5
e    9
Name: var1, dtype: int32

In [39]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3  var4
b     2     5     5   0.4
c     9     3     7   3.0
d     5     2     6   2.5
e     9     2     1   4.5

# değişken silmek

In [40]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [41]:
df

   var1  var2  var3  var4
b     2     5     5   0.4
c     9     3     7   3.0
d     5     2     6   2.5
e     9     2     1   4.5

# kalıcı olarak bir değeri silmek

In [42]:
df.drop("var4", axis = 1, inplace = True)

In [43]:
df

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1

In [44]:
l = ["var1", "var2"]

In [45]:
df.drop(l, axis = 1)

   var3
b     5
c     7
d     6
e     1

In [46]:
df

   var1  var2  var3
b     2     5     5
c     9     3     7
d     5     2     6
e     9     2     1